Repository: aiiie/dnuos
Catalog: dnuos/locale/*/LC_MESSAGES/dnuos.po
Languages: fr

source: Failed to delete cache: %s
fr: La suppression du cache a échoué : %s

source: Removed cache directory %s
fr: Le dossier de cache %s a été supprimé

source: Culled %d non-existent directories
fr: Suppression de %d dossiers inexistants

source: Failed to create cache directory:
fr: La création du dossier de cache a échoué :

source: Use the --disable-cache switch to disable caching
fr: Utilisez l'option --disable-cache pour interdire le cache

source: Format string can only contain valid fields
fr: La chaîne de sortie ne doit contenir que des champs valides

source: Use the --help-output-string switch for more information
fr: Utilisez l'option --help-output-string pour plus d'information

source: Failed to save cache data:
fr: L'enregistrement des données de cache a échoué :

source: %sB processed
fr: %sB traités

source: Audiotype failed for:
fr: Audiotype a échoué pour :

source: Anything enclosed by brackets is considered a field. A field must have the following syntax: [TAG] [TAG,WIDTH] [TAG,WIDTH,SUFFIX] [TAG,,SUFFIX] TAG is any of the following characters: a list of bitrates in Audiolist compatible format A artist name as found in ID3 tags b bitrate with suffix (e.g. 192k) B bitrate in bps C album name as found in ID3 tags D depth; distance from respective basedir f number of audio files (including spacers) l length in minutes and seconds L length in seconds m time of last change M time of last change in seconds since the epoch n directory name (indented) N directory name p profile P full path q quality s size with suffix (e.g 65.4M) S size in bytes t file type T bitrate type: ~ mixed files C constant bitrate L lossless compression V variable bitrate V encoder Y year as found in ID3 tags WIDTH defines the exact width of the field. The output is cropped to this width if needed. Negative values will give left aligned output. Cropping is always done on the right. SUFFIX lets you specify a unit to be concatenated to all non-empty data. Other interpreted sequences are: \[ [ \] ] \n new line \t tab character Unescaped brackets are forbidden unless they define a field. Note: If you have any whitespace in your output string you must put it inside quotes or otherwise it will not get parsed right.
fr: Tout texte entre crochets est considéré comme un champ. Un champ doit être utilisé avec la syntaxe suivante : [BALISE] [BALISE,LARGEUR] [BALISE,LARGEUR,SUFFIXE] [BALISE,,SUFFIXE] BALISE n'importe lequel des caractères suivants : a une liste de bitrates en format compatible avec Audiolist A le nom d'artiste spécifié à la manière des balises ID3 b le bitrate avec son suffixe (par ex. 192k) B le bitrate en bps C le nom d'album spécifié à la manière des balises ID3 D profondeur ; la distance par rapport au basedir respectif f le nombre de fichiers audio (incluant les spaceurs) l la durée en minutes et secondes L la durée en secondes m la date de la dernière modification M la date de la dernière modification en temps UNIX n le nom du dossier (indenté) N le nom du dossier p le profil P le chemin complet du dossier q la qualité s la taille avec suffixe (par ex. 65,4M) S la taille en octets t le type du fichier T le type du bitrate : ~ fichiers mélangés C bitrate constant L compression sans perte V bitrate variable V l'encodeur Y l'année de sortie d'album à la manière des balises ID3 LARGEUR définit la largeur exacte du champ. La sortie est alignée à cette largeur si nécessaire. Les valeurs négatives résulteront en un alignement à gauche. La troncature est toujours effectuée à droite. SUFFIXE spécifie une chaîne à adjoindre à toutes données non vides. D'autres chaînes interprétées : \[ [ \] ] \n nouvelle ligne \t caractère tab Les crochets non échappés sont interdits, à moins qu'ils ne définissent un champ. Note : Si vous avez des espaces blancs dans la chaîne de sortie, vous devez les mettre entre guillemets, sinon ils ne seront pas analysés correctement.

source: The %s option is deprecated and will be removed in a future version. Use --template=db --file=FILE instead to ensure compatibility with future versions.
fr: L'option %s est dépréciée et sera supprimée dans une prochaine version. Utilisez plutôt --template=db --file=FICHIER pour assurer compatibilité avec de prochaines versions.

source: Bad format string argument to %s
fr: La chaîne de sortie pour %s est invalide

source: The %s option is deprecated and will be removed in a future version. Use --template=html instead to ensure compatibility with future versions.
fr: L'option %s est dépréciée et sera supprimée dans une prochaine version. Utilisez plutôt --template=html pour assurer compatibilité avec de prochaines versions.

source: Bitrate must be 0 or in the range (1..320)
fr: Le bitrate doit être égal à 0 ou compris dans la plage (1..320)

source: Unknown template %s
fr: Template inconnu %s'

source: Invalid argument to %s
fr: L'argument pour %s est invalide

source: No such directory: %s
fr: Il n'y a pas de dossier : %s

source: Show this help message and exit
fr: Afficher ce message d'aide et s'arrêter

source: Show output string help message
fr: Afficher l'aide pour la chaîne de sortie

source: Output debug trace to stderr
fr: Envoyer la sortie du débogage vers stderr

source: Don't list files that cause Audiotype failure
fr: Ne pas afficher les fichiers qui mettent Audiotype en échec

source: Omit progress indication
fr: Omettre les indications de progression

source: Display version
fr: Afficher la version

source: Caching
fr: Cache

source: Store cache in DIR (default %s)
fr: Enregistrer le cache dans DOSSIER (%s par défaut)

source: DIR
fr: DOSSIER

source: Cull non-existent cached directories and exit
fr: Supprimer les dossiers inexistants mis en cache et terminer

source: Delete the cache directory and exit
fr: Supprimer le dossier de cache et terminer

source: Disable caching
fr: Désactiver le cache

source: Directory walking
fr: Recherche de dossier

source: Exclude DIR from search
fr: Exclure DOSSIER de recherche

source: Case-insensitive directory sorting
fr: Ne pas tenir compte de la casse dans l'ordonnancement des dossiers

source: List audio files in directories (doesn't use caching)
fr: Lister les fichiers audio dans les dossiers (n'utilise pas la mise en cache)

source: Parse basedirs in parallel and merge output
fr: Analyser les répertoires parents en parallèle et combiner les sorties

source: A comma-separated list of unknown audio types to list
fr: Une liste de types audio inconnus, séparés par des virgules

source: Expand wildcards in basedirs
fr: Développer les caractères génériques dans les répertoires parents

source: Filtering
fr: Filtrage

source: Exclude MP3s with bitrate lower than MIN (in Kbps)
fr: Exclure les MP3 avec un bitrate inférieur à MIN (en Kbps)

source: Exclude MP3s with no LAME profile
fr: Exclure les MP3 sans profil LAME

source: Exclude MP3s with constant bitrates
fr: Exclure les MP3 aux bitrates constants

source: Exclude directories with mixed files
fr: Exclure les dossiers contenant plusieurs formats de fichier audio

source: Output
fr: Sortie

source: Set HTML background COLOR (default %s)
fr: Mettre la COULEUR arrière-plan pour la sortie HTML (%s par défaut)

source: COLOR
fr: COULEUR

source: Write output to FILE
fr: Écrire la sortie dans FICHIER

source: FILE
fr: FICHIER

source: HTML output (deprecated, use --template html)
fr: Sortie HTML (déprécié, utilisez --template html)

source: Set indent to n (default %s)
fr: Fixer l'indentation à n (%s par défaut)

source: Set output format STRING used in plain-text and HTML output. See --help-output-string for details on syntax. (default %s)
fr: Définir la chaîne de sortie utilisée pour les sorties en texte brut et code HTML. Voyez --help-output-string pour plus d'information à propos de la syntaxe. (%s par défaut)

source: STRING
fr: CHAÎNE

source: Write list in output.db format to FILE (deprecated, use --template db)
fr: Écrire la liste dans FICHIER, au format output.db (déprecié, utilisez --template db)

source: If both ID3v1 and ID3v2 tags exist, prefer n (1 or 2) (default %s)
fr: Si des balises ID3v1 et ID3v2 existent, préférer n (1 ou 2) (%s par défaut)

source: Strip output of field headers and empty directories
fr: Supprimer de la sortie les en-têtes de champ et les dossiers vides

source: Set output TEMPLATE (default plaintext)
fr: Activer le TEMPLATE de sortie (plaintext par défaut)

source: Set HTML text COLOR (default %s)
fr: Mettre le texte HTML dans cette COULEUR (%s par défaut)

source: Statistics
fr: Statistiques

source: Display datestamp header
fr: Afficher les informations de date/heure dans l'en-tête

source: Display statistics results
fr: Afficher les résultats statistiques

source: Display elapsed time footer
fr: Afficher le temps d'exécution en pied de page

source: No folders to process. Type `%s -h' for help.
fr: Il n'y a aucun dossier à traiter. Exécutez `%s -h' pour aide.

source: No such file or directory: %s
fr: Il n'y a pas de fichier ou dossier : %s

source: Artist
fr: Artiste

source: Depth
fr: Profondeur

source: Files
fr: Fichiers

source: Length
fr: Durée

source: Modified
fr: Modification

source: Album/Artist
fr: Album/Artiste

source: Profile
fr: Profil

source: Path
fr: Chemin

source: Quality
fr: Qualité

source: Size
fr: Taille

source: BR Type
fr: Type du BR

source: Encoder
fr: Encodeur

source: Year
fr: Année

source: en
fr: fr

source: Music List
fr: Liste de musique

source: Audiotype failed on the following files:
fr: Audiotype a échoué avec ces fichiers :

source: Generation time: %s s
fr: Temps de génération : %s s

source: | Format Amount (Mb) | Ratio (%) |
fr: | Format Quantité (Mo) | Rapport (%) |

source: %9.2f
fr: %12.2f

source: | %-8s %s | %s |
fr: | %-10s %s |%s |

source: | Total %s Mb |
fr: | Total %s Mo |

source: | Speed %s Mb/s |
fr: | Vitesse %s Mo/s |

source: no such option: %s
fr: option inexistante : %s

source: ambiguous option: %s (%s?)
fr: option ambiguë : %s (%s ?)

source: Usage: %s
fr: Utilisation : %s

source: Usage
fr: Utilisation

source: integer
fr: entier

source: long integer
fr: entier long

source: floating-point
fr: virgule flottante

source: complex
fr: complexe

source: option %s: invalid %s value: %r
fr: option %s : valeur %s invalide : %r

source: option %s: invalid choice: %r (choose from %s)
fr: option %s : choix invalide : %r (choisir parmi %s)

source: show this help message and exit
fr: montre ce message d'aide et s'arrête

source: show program's version number and exit
fr: affiche la version du programme et s'arrête

source: %s option requires an argument
fr: l'option %s requiert un paramètre

source: %s option requires %d arguments
fr: l'option %s requiert %d paramètres

source: %s option does not take a value
fr: l'option %s ne prend pas de valeurs
